---
kind: method
id: M:Autodesk.Revit.DB.Definitions.GetBasicIEnumerator
source: html/693c4c01-d217-9dfd-9294-b00ca15a9256.htm
---
# Autodesk.Revit.DB.Definitions.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.